<?php

use Illuminate\Database\Seeder;

class PositionProfessionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                '1114-002-02-0-00',
                'Директор',
                'created_at' => now(),
            ],
            [
                '1211-002-02-0-04',
                'Главный бухгалтер',
                'created_at' => now(),
            ],
            [
                '7122-004-01-3-00',
                'Облицовщик плиточник 3 разряда',
                'created_at' => now(),
            ],
            [
                '2149-022-02-0-00',
                'Инженер по охране труда',
                'created_at' => now(),
            ],
            [
                '1323-041-02-0-00',
                'Производитель работ',
                'created_at' => now(),
            ],
            [
                '7114-006-01-3-00',
                'Плотник-бетонщик 3 разряда',
                'created_at' => now(),
            ],
            [
                '2423-003-02-0-05',
                'Ведущий специалист по кадрам',
                'created_at' => now(),
            ],
            [
                '9313-001-01-2-00',
                'Подсобный рабочий 2 разряда',
                'created_at' => now(),
            ],
            [
                '3333-003-02-0-00',
                'Инспектор по кадрам',
                'created_at' => now(),
            ],
            [
                '7123-003-01-4-00',
                'Штукатур 4 разряда',
                'created_at' => now(),
            ],
            [
                '7131-001-01-5-00',
                'Маляр 5 разряда',
                'created_at' => now(),
            ],
            [
                '1323-018-02-0-00',
                'Мастер строительных и монтажных работ',
                'created_at' => now(),
            ],
            [
                '2149-026-02-0-00',
                'Инженер по сметной работе',
                'created_at' => now(),
            ],
            [
                '7115-005-01-3-00',
                'Плотник 3 разряда',
                'created_at' => now(),
            ],
            [
                '7114-004-01-3-00',
                'Бетонщик 3 разряда',
                'created_at' => now(),
            ],
            [
                '1120-   -00-7-  ',
                'Главный инженер',
                'created_at' => now(),
            ],
            [
                '7123-003-01-3-00',
                'Штукатур 3 разряда',
                'created_at' => now(),
            ],
            [
                '7114-001-01-2-00',
                'Арматурщик 2 разряда',
                'created_at' => now(),
            ],
            [
                '7131-001-01-4-00',
                'Маляр 4 разряда',
                'created_at' => now(),
            ],
        ];
        
        DB::table('position_professions')->insert($data);
    }
}
